In [2]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.read_excel("comb1.xlsx")
df2 = pd.read_excel("comb2.xlsx")

In [10]:
comb_df2 = pd.concat([df1, df2], axis = 1)
comb_df2

,Name,Id,Department,Salary,Id,Department,Salary,Product_sale,No_Of_Product
0,Raj,101,Computer,45000,101,Computer,45000,Parts,2
1,Titu,102,ai,30000,102,ai,30000,Software,3
2,Manshi,103,ml,35000,103,ml,35000,Software,2
3,Yash,104,ai,45000,104,ai,45000,Software,5
4,Zaker,105,ai,50000,105,ai,50000,Parts,5
5,Santa,106,ml,65000,106,ml,65000,Parts,4
6,Catwomen,107,Computer,25000,107,Computer,25000,Parts,5

In [11]:
smallText = lambda x: x.lower()

In [14]:
#appling this funtion in any one column in out datafram
comb_df3 = comb_df2['Product_sale'].apply(smallText)

In [15]:
comb_df3

0       parts
1    software
2    software
3    software
4       parts
5       parts
6       parts
Name: Product_sale, dtype: object

In [16]:
comb_df2

,Name,Id,Department,Salary,Id,Department,Salary,Product_sale,No_Of_Product
0,Raj,101,Computer,45000,101,Computer,45000,Parts,2
1,Titu,102,ai,30000,102,ai,30000,Software,3
2,Manshi,103,ml,35000,103,ml,35000,Software,2
3,Yash,104,ai,45000,104,ai,45000,Software,5
4,Zaker,105,ai,50000,105,ai,50000,Parts,5
5,Santa,106,ml,65000,106,ml,65000,Parts,4
6,Catwomen,107,Computer,25000,107,Computer,25000,Parts,5

In [18]:
# ----------------------------------***---------------------------------------------------------------

In [20]:
from sklearn import preprocessing
data = {'price':[492, 286, 487, 519, 541, 429]}
price_frame = pd.DataFrame(data)
min_max_normalizer = preprocessing.MinMaxScaler()
scaled_data = min_max_normalizer.fit_transform(price_frame)
price_frame_normalized = pd.DataFrame(scaled_data)
price_frame_normalized

          0
0  0.807843
1  0.000000
2  0.788235
3  0.913725
4  1.000000
5  0.560784